ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p551x_pctrace_regs.xml
<module id="PCTRACE_REGS" HW_revision="" description="PCTRACE Registers">
	<register id="PCTRACE_GLOBAL" width="16" page="1" offset="0x0" internal="0" description="PCTRACE_GLOBAL">
		<bitfield id="EN" description="Enable PC  trace" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT" description="Initialize the PC Trace and buffer pointer" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="PCTRACE_BUFFER" width="16" page="1" offset="0x1" internal="0" description="PCTRACE_BUFFER">
		<bitfield id="PTR" description="Trace Buffer Pointer" begin="9" end="0" width="10" rwaccess="R"/>
		<bitfield id="BUFFER_FULL" description="Trace Buffer Full" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="PCTRACE_QUAL1" width="32" page="1" offset="0x2" internal="0" description="PCTRACE_QUAL1">
		<bitfield id="WINDOWED_INP_SEL" description="Windowed trace qualifier" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="TRACE_MODE" description="Trace qualifier mode" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="WINDOWED_INP_INV" description="Windowed trace Input Invert" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="WINDOWED_INP_SYNCH" description="Windowed trace input synchronizer enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="START_INP_INV" description="Start input Invert" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="START_INP_SYNCH" description="Start input synchronizer enable" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="STOP_INP_INV" description="Stop input Invert" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="STOP_INP_SYNCH" description="Stop input synchronizer enable" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="PCTRACE_QUAL2" width="32" page="1" offset="0x4" internal="0" description="PCTRACE_QUAL2">
		<bitfield id="START_INP_SEL" description="Trace Start event select" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="STOP_INP_SEL" description="Trace Stop event select" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="PCTRACE_LOGPC_SOFTENABLE" width="32" page="1" offset="0x6" internal="0" description="PCTRACE_LOGPC_SOFTENABLE">
		<bitfield id="PC_SOFTENABLE" description="PC when PC Trace was last enabled by software" begin="21" end="0" width="22" rwaccess="R"/>
	</register>
	<register id="PCTRACE_LOGPC_SOFTDISABLE" width="32" page="1" offset="0x8" internal="0" description="PCTRACE_LOGPC_SOFTDISABLE">
		<bitfield id="PC_SOFTDISABLE" description="PC when PC Trace was last disabled by software" begin="21" end="0" width="22" rwaccess="R"/>
	</register>
</module>
